colo_emojis = {
    "SJC": "🇺🇸",  # 圣何塞
    "LAX": "🇺🇸",  # 洛杉矶
    "SEA": "🇺🇸",  # 西雅图
    "JFK": "🇺🇸",  # 纽约 - 肯尼迪国际机场
    "ORD": "🇺🇸",  # 芝加哥 - 奥黑尔国际机场
    "IAD": "🇺🇸",  # 华盛顿杜勒斯国际机场
    "EWR": "🇺🇸",  # 纽瓦克自由国际机场
    "CMH": "🇺🇸",  # 哥伦布国际机场
    "PDX": "🇺🇸",  # 俄勒冈州 - 波特兰国际机场
    "US": "🇺🇸",   # 美国

    # 加拿大
    "YUL": "🇨🇦",  # 蒙特利尔皮埃尔·埃利奥特·特鲁多国际机场
    "YYZ": "🇨🇦",  # 多伦多皮尔逊国际机场
    "YVR": "🇨🇦",  # 温哥华国际机场
    "CA": "🇨🇦",  # 加拿大

    # 德国
    "FRA": "🇩🇪",  # 法兰克福机场
    "DE": "🇩🇪",  # 德国

    # 法国
    "CDG": "🇫🇷",  # 巴黎戴高乐机场
    "FR": "🇫🇷",  # 法国

    # 英国
    "LHR": "🇬🇧",  # 伦敦
    "UK": "🇬🇧",  # 英国

    # 荷兰
    "AMS": "🇳🇱",  # 阿姆斯特丹史基浦机场
    "NL": "🇳🇱",  # 荷兰

    # 日本
    "NRT": "🇯🇵",  # 东京成田
    "HND": "🇯🇵",  # 东京羽田
    "KIX": "🇯🇵",  # 大阪关西国际机场
    "JP": "🇯🇵",  # 日本

    # 香港
    "HKG": "🇭🇰",  # 香港国际机场
    "HK": "🇭🇰",  # 香港

    # 韩国
    "ICN": "🇰🇷",  # 仁川国际机场
    "KR": "🇰🇷",  # 韩国

    # 台湾
    "TPE": "🇹🇼",  # 台北桃园机场
    "KHH": "🇹🇼",  # 台湾高雄
    "TW": "🇹🇼",  # 台湾

    # 新加坡
    "SIN": "🇸🇬",  # 樟宜机场
    "SG": "🇸🇬",  # 新加坡

    # 印度
    "BOM": "🇮🇳",  # 孟买国际机场
    "IN": "🇮🇳",  # 印度

    # 瑞典
    "ARN": "🇸🇪",  # 斯德哥尔摩阿兰达机场
    "SE": "🇸🇪",  # 瑞典

    # 芬兰
    "HEL": "🇫🇮",  # 赫尔辛基
    "FI": "🇫🇮",  # 芬兰

    # 巴西
    "GRU": "🇧🇷",  # 圣保罗瓜鲁柳斯国际机场
    "BR": "🇧🇷",  # 巴西

    # 波兰
    "WAW": "🇵🇱",  # 华沙
    "PL": "🇵🇱",  # 波兰

    # 澳大利亚
    "SYD": "🇦🇺",  # 悉尼国际机场（澳大利亚）
    "AU": "🇦🇺",  # 澳大利亚

    # CF优选
    "CF优选": "☁️"  # CF优选
}
